
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.redis_connection_string
  * module.redis-cache.azurerm_redis_cache.redis
  * module.redis-cache.azurerm_resource_group.cache-resourcegroup[0]
* Delete
  * azurerm_key_vault_secret.redis6_connection_string
  * module.redis6-cache.azurerm_private_endpoint.this[0]
  * module.redis6-cache.azurerm_redis_cache.redis
  * module.redis6-cache.azurerm_resource_group.cache-resourcegroup[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis6_connection_string will be destroyed
  # (because azurerm_key_vault_secret.redis6_connection_string is not in configuration)
  - resource "azurerm_key_vault_secret" "redis6_connection_string" {
      - content_type            = "" -> null
      - id                      = "https://rpx-aat.vault.azure.net/secrets/webapp-redis6-connection-string/507dfe1ae1444b7e8bf06e807772de3d" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-aat/providers/Microsoft.KeyVault/vaults/rpx-aat" -> null
      - name                    = "webapp-redis6-connection-string" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-aat/providers/Microsoft.KeyVault/vaults/rpx-aat/secrets/webapp-redis6-connection-string/versions/507dfe1ae1444b7e8bf06e807772de3d" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-aat/providers/Microsoft.KeyVault/vaults/rpx-aat/secrets/webapp-redis6-connection-string" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "507dfe1ae1444b7e8bf06e807772de3d" -> null
      - versionless_id          = "https://rpx-aat.vault.azure.net/secrets/webapp-redis6-connection-string" -> null
    }

  # azurerm_key_vault_secret.redis_connection_string will be created
  + resource "azurerm_key_vault_secret" "redis_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-aat/providers/Microsoft.KeyVault/vaults/rpx-aat"
      + name                    = "webapp-redis-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.redis-cache.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "rpx-mc-redis-aat"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = "4"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "rpx-mc-redis-cache-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + subnet_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-1-aat"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/rpx-xui-webapp.git"
          + "application"         = "expert-ui"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#xui-pipeline"
          + "environment"         = "staging"
          + "managedBy"           = "Expert UI"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

  # module.redis-cache.azurerm_resource_group.cache-resourcegroup[0] will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rpx-mc-redis-cache-aat"
      + tags     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/rpx-xui-webapp.git"
          + "application"         = "expert-ui"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#xui-pipeline"
          + "environment"         = "staging"
          + "managedBy"           = "Expert UI"
        }
    }

  # module.redis6-cache.azurerm_private_endpoint.this[0] will be destroyed
  # (because azurerm_private_endpoint.this is not in configuration)
  - resource "azurerm_private_endpoint" "this" {
      - custom_dns_configs       = [] -> null
      - id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-mc-redis6-cache-aat/providers/Microsoft.Network/privateEndpoints/rpx-mc-redis6-aat" -> null
      - location                 = "uksouth" -> null
      - name                     = "rpx-mc-redis6-aat" -> null
      - network_interface        = [
          - {
              - id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-mc-redis6-cache-aat/providers/Microsoft.Network/networkInterfaces/rpx-mc-redis6-aat.nic.288e3dd6-e5a9-4a72-9ca6-9a3fb72b65bd"
              - name = "rpx-mc-redis6-aat.nic.288e3dd6-e5a9-4a72-9ca6-9a3fb72b65bd"
            },
        ] -> null
      - private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-mc-redis6-cache-aat/providers/Microsoft.Network/privateEndpoints/rpx-mc-redis6-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "xui-webapp-aat.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.96.136.23",
                        ]
                      - name         = "xui-webapp-aat"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> null
      - resource_group_name      = "rpx-mc-redis6-cache-aat" -> null
      - subnet_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-2-aat" -> null
      - tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/rpx-xui-webapp.git"
          - "application"         = "expert-ui"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#xui-pipeline"
          - "environment"         = "staging"
          - "managedBy"           = "Expert UI"
        } -> null

      - private_dns_zone_group {
          - id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-mc-redis6-cache-aat/providers/Microsoft.Network/privateEndpoints/rpx-mc-redis6-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> null
          - name                 = "redis-endpoint-dnszonegroup" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ] -> null
        }

      - private_service_connection {
          - is_manual_connection           = false -> null
          - name                           = "rpx-mc-redis6-aat" -> null
          - private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-mc-redis6-cache-aat/providers/Microsoft.Cache/Redis/xui-webapp-aat" -> null
          - private_ip_address             = "10.96.136.23" -> null
          - subresource_names              = [
              - "redisCache",
            ] -> null
        }
    }

  # module.redis6-cache.azurerm_redis_cache.redis will be destroyed
  # (because azurerm_redis_cache.redis is not in configuration)
  - resource "azurerm_redis_cache" "redis" {
      - capacity                      = 1 -> null
      - enable_non_ssl_port           = false -> null
      - family                        = "P" -> null
      - hostname                      = "xui-webapp-aat.redis.cache.windows.net" -> null
      - id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-mc-redis6-cache-aat/providers/Microsoft.Cache/Redis/xui-webapp-aat" -> null
      - location                      = "uksouth" -> null
      - minimum_tls_version           = "1.2" -> null
      - name                          = "xui-webapp-aat" -> null
      - port                          = 6379 -> null
      - primary_access_key            = (sensitive value)
      - primary_connection_string     = (sensitive value)
      - public_network_access_enabled = false -> null
      - redis_version                 = "6.0.14" -> null
      - replicas_per_master           = 0 -> null
      - replicas_per_primary          = 0 -> null
      - resource_group_name           = "rpx-mc-redis6-cache-aat" -> null
      - secondary_access_key          = (sensitive value)
      - secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      - sku_name                      = "Premium" -> null
      - ssl_port                      = 6380 -> null
      - tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/rpx-xui-webapp.git"
          - "application"         = "expert-ui"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#xui-pipeline"
          - "environment"         = "staging"
          - "managedBy"           = "Expert UI"
        } -> null
      - tenant_settings               = {} -> null
      - zones                         = [] -> null

      - redis_configuration {
          - aof_backup_enabled              = false -> null
          - enable_authentication           = true -> null
          - maxclients                      = 7500 -> null
          - maxfragmentationmemory_reserved = 642 -> null
          - maxmemory_delta                 = 642 -> null
          - maxmemory_policy                = "volatile-lru" -> null
          - maxmemory_reserved              = 642 -> null
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
        }
    }

  # module.redis6-cache.azurerm_resource_group.cache-resourcegroup[0] will be destroyed
  # (because azurerm_resource_group.cache-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "cache-resourcegroup" {
      - id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-mc-redis6-cache-aat" -> null
      - location = "uksouth" -> null
      - name     = "rpx-mc-redis6-cache-aat" -> null
      - tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/rpx-xui-webapp.git"
          - "application"         = "expert-ui"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#xui-pipeline"
          - "environment"         = "staging"
          - "managedBy"           = "Expert UI"
        } -> null
    }

Plan: 3 to add, 0 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":3128,"Program":"tfcmt","SHA1":"","Vars":{}} -->